app/controllers/posts/comments_controller.rb

  def set_commentable
    @commentable=Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 150], ["LIMIT", 1]]