app/views/profiles/index.html.erb

    <%# end %>
      <%if user.profile.cities.present? %>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2