app/services/events/stripe_handler.rb

SELECT "users".* FROM "users" WHERE "users"."stripe_id" = $1 LIMIT $2  [["stripe_id", "cus_MREP9S65RqxgFM"], ["LIMIT", 1]]
---
    def self.process(event)
      stripe_event = Stripe::Event.construct_from(event.data)

      case stripe_event.type
      when 'checkout.session.completed'
        checkout_session = stripe_event.data.object
        #checkout_session is now the variable that refers to all the data in that particular webhook so we can use checkout_session.customer.id for example.
        user = User.find_by(stripe_id: checkout_session.customer)