app/models/member/import.rb

    def process!
      @imported_count = 0
      CSV.foreach(file.path, headers: true, header_converters: %i[symbol date]) do |row|
        member = Member.assign_from_row(row)
        if member.save
---
INSERT INTO "members" ("last_name", "email", "created_at", "updated_at", "full_name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "members" SET "last_name" = $1, "email" = $2, "full_name" = $3, "updated_at" = $4 WHERE "members"."id" = $5