app/views/comments/_comment.html.erb

    <div id="comment_<%= comment.id %>">
        <% if comment.user.avatar.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 718], ["LIMIT", 1]]