app/views/sermons/_form.html.erb

SELECT "homilists".* FROM "homilists"
---
      <%= f.label :homilist %><br>
      <%= f.collection_select :homilist_id, Homilist.all, :id, :name, include_blank: true, label: 'Homilist' %>