app/views/sermons/index.html.erb

SELECT "sermons".* FROM "sermons" ORDER BY delivered_on DESC
---
        <td><%= link_to sermon.title, sermon %> <% if current_user && current_user.admin? %>
          | words: <%= sermon.sermon_body.split.count %>  &nbsp; | <%= link_to sermon,  method: :delete, data: { confirm: 'This will delete this sermon.' } do %> Delete!