app/views/posts/_posts.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 718], ["LIMIT", 1]]
---
  <br>
  <% if post.user.avatar.present? %><div id="avatar-owner">