app/views/posts/show.html.erb


<% if @post.user.avatar.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 718], ["LIMIT", 1]]