app/views/opportunities/index.html.erb

              <p><strong>Where </strong>&#09;<%= opportunity.where %></p>
              <!--  <%# if opportunity.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 718], ["LIMIT", 1]]