app/controllers/checkout_donations_controller.rb

SELECT "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 161], ["LIMIT", 1]]
---
  def create
    @donation = Donation.find(params[:id])