app/controllers/comments_controller.rb

def create
  @comment = comment_from_params
  @comment.post_id = params[:post_id]
  @comment.body = params[:comment][:body]
  @comment.user = current_user
  @comment.save
---
INSERT INTO "comments" ("user_id", "commentable_type", "commentable_id", "parent_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"