app/controllers/donations_controller.rb

INSERT INTO "donations" ("user_id", "created_at", "updated_at", "type", "stripe_id", "amount", "dollars", "status", "memo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @donation = Donation.new(donation_params)
    @donation.user_id = current_user.id
    if @donation.save

DELETE FROM "donations" WHERE "donations"."id" = $1  [["id", 161]]
---
  def destroy
    @donation.destroy

SELECT "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 161], ["LIMIT", 1]]
---
    def set_donation
      @donation = Donation.find(params[:id])