app/controllers/home_controller.rb

  def index
    @event = Event.find(11)
    @ens_feed = EnsFeed.all.order('published_at DESC').limit(6)
    @christmas_eve = Link.find_by(event: "christmas_eve")
    @christmas_day = Link.find_by(event: "christmas_day")
    @worship = Link.find_by(event: "worship")
    @bulletin = Link.find_by(event: "bulletin")
    @wine = Link.find_by(event: "wine_time")
    @coffee = Link.find_by(event: "coffee")
    @tgiving_coffee = Link.find_by(event: "tgiving_coffee")
    @day_bible = Link.find_by(event: "day_bible")
    @evening_bible = Link.find_by(event: "evening_bible")
    @thanksgiving = Link.find_by(event: "thanksgiving")
    @thanksgiving_bulletin = Link.find_by(event: "thanksgiving_bulletin")
    @pathway = Pathway.order("created_at ASC").last
---
SELECT "ens_feeds".* FROM "ens_feeds" ORDER BY published_at DESC LIMIT $1  [["LIMIT", 6]]
SELECT "links".* FROM "links" WHERE "links"."event" = $1 LIMIT $2  [["event", "bulletin"], ["LIMIT", 1]]
SELECT "links".* FROM "links" WHERE "links"."event" = $1 LIMIT $2  [["event", "wine_time"], ["LIMIT", 1]]
SELECT "links".* FROM "links" WHERE "links"."event" = $1 LIMIT $2  [["event", "coffee"], ["LIMIT", 1]]
SELECT "links".* FROM "links" WHERE "links"."event" = $1 LIMIT $2  [["event", "evening_bible"], ["LIMIT", 1]]
SELECT "pathways".* FROM "pathways" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]