app/controllers/links_controller.rb

  def index
    @links = Link.all
    @worship = Link.find_by(event: 'worship')
    @bulletin = Link.find_by(event: 'bulletin')
---
SELECT "links".* FROM "links"
SELECT "links".* FROM "links" WHERE "links"."event" = $1 LIMIT $2  [["event", "bulletin"], ["LIMIT", 1]]
SELECT "links".* FROM "links" WHERE "links"."event" = $1 LIMIT $2  [["event", "wine_time"], ["LIMIT", 1]]