app/controllers/members_controller.rb

  def index
    @members = Member.all.order(:last_name)
    @importmember = Member::Import.new
    @diaspora = Member.where.not(away_zip: nil).where.not(email: nil)
---
SELECT "members".* FROM "members" ORDER BY "members"."last_name" ASC
SELECT "members".* FROM "members" WHERE "members"."away_zip" IS NOT NULL AND "members"."email" IS NOT NULL