app/controllers/opportunities_controller.rb

  def index
    @opportunities = Opportunity.order(:ministry)
---
SELECT "opportunities".* FROM "opportunities" ORDER BY "opportunities"."ministry" ASC