app/controllers/pathways_controller.rb

SELECT "pathways".* FROM "pathways" ORDER BY pubdate DESC
---
  def index
    @pathways = Pathway.all.order('pubdate DESC')