app/controllers/pledges_controller.rb

SELECT "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
---
  def review
    @pledge = Pledge.find(params[:id])

SELECT "pledges".* FROM "pledges" WHERE "pledges"."user_id" = $1 LIMIT $2  [["user_id", 718], ["LIMIT", 1]]
---
  def set_pledge
    @pledge = Pledge.find(current_user.pledge.id)