app/controllers/pledges_controller.rb

INSERT INTO "pledges" ("divisor", "user_id", "created_at", "updated_at", "amount", "pay_this", "plan") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    @pledge = Pledge.new(pledge_params)
    @pledge.user_id = current_user.id if current_user
    if @pledge.save

UPDATE "pledges" SET "amount" = $1, "pay_this" = $2, "updated_at" = $3 WHERE "pledges"."id" = $4
---
  def update
    @pledge.update_attributes(pledge_params)

SELECT  "pledges".* FROM "pledges" WHERE "pledges"."user_id" = $1 LIMIT $2
---
  def set_pledge
    @pledge = Pledge.find(current_user.pledge.id)

SELECT  "pledges".* FROM "pledges" WHERE "pledges"."user_id" = $1 LIMIT $2
---
  def change_pledge
    if current_user.pledge.present?