app/controllers/pledges_controller.rb

SELECT "pledges".* FROM "pledges" WHERE "pledges"."user_id" = $1 LIMIT $2  [["user_id", 718], ["LIMIT", 1]]
---
  def change_pledge
    if current_user.pledge.present?