app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @post = Post.new
    @pray_fors = PrayFor.all
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "pray_fors".* FROM "pray_fors"

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2023-01-11 15:23:15.355566"], ["updated_at", "2023-01-11 15:23:15.355566"], ["user_id", 718]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2023-01-11 15:23:15.396877"], ["id", 147]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 146], ["LIMIT", 1]]