app/controllers/pray_fors_controller.rb

INSERT INTO "pray_fors" ("first_name", "reason", "honey", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Johnny"], ["reason", "He's sick"], ["honey", nil], ["created_at", "2023-02-15 19:59:30.089662"], ["updated_at", "2023-02-15 19:59:30.089662"]]
---
  def create
    @pray_for = PrayFor.new(pray_for_params)
      if @pray_for.save

SELECT "pray_fors".* FROM "pray_fors" WHERE "pray_fors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_pray_for
      @pray_for = PrayFor.find(params[:id])