app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
    @profile = Profile.find(current_user.profile.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2