app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
    @profile = Profile.find(current_user.profile.id)
    @users = User.order(:last_name)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 776], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."last_name" ASC

  def set_profile
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 668], ["LIMIT", 1]]