app/controllers/sermons_controller.rb

SELECT "sermons".* FROM "sermons" ORDER BY delivered_on DESC
---
  def index
    @sermons = Sermon.order('delivered_on DESC')

SELECT "sermons".* FROM "sermons" WHERE "sermons"."id" = $1 LIMIT $2  [["id", 118], ["LIMIT", 1]]
---
  def set_sermon
    @sermon = Sermon.find(params[:id])