app/controllers/sermons_controller.rb

SELECT  "sermons".* FROM "sermons" WHERE "sermons"."id" = $1 LIMIT $2
---
  def set_sermon
    @sermon = Sermon.find(params[:id])