app/controllers/stripe_reports_controller.rb

  def index
    @stripe_reports = StripeReport.all
---
SELECT "stripe_reports".* FROM "stripe_reports"