app/controllers/users_controller.rb

  def index
    @users = User.all.order(:last_name)
---
SELECT "users".* FROM "users" ORDER BY "users"."last_name" ASC

  def set_user
    @user=User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 160], ["LIMIT", 1]]