app/controllers/vestry_minutes_controller.rb

  def index
    @vestry_minutes = VestryMinute.all
---
SELECT "vestry_minutes".* FROM "vestry_minutes" ORDER BY created_at DESC