app/controllers/webhook_events_controller.rb

  def create
    if !valid_signatures?
      render json: {message: "signature invalid"}, status: 400
      return
    end

    #check if already handled; idempotent
    if !WebhookEvent.find_by(source:params[:source], external_id: external_id).nil?
      render json: { message: "Already procesed #{ external_id }"}
      return
    end
    event = WebhookEvent.create(webhook_params)
---
SELECT "webhook_events".* FROM "webhook_events" WHERE "webhook_events"."source" IS NULL AND "webhook_events"."external_id" = $1 LIMIT $2  [["external_id", "d97f17220eb61fe00b2369dd830c4008"], ["LIMIT", 1]]
INSERT INTO "webhook_events" ("source", "external_id", "data", "state", "processing_errors", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"