app/models/member.rb

  def self.assign_from_row(row)
    member = Member.where(membership_id: row[:membership_id]).first_or_initialize
---
SELECT  "members".* FROM "members" WHERE "members"."membership_id" IS NULL ORDER BY "members"."id" ASC LIMIT $1