app/models/user.rb

  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if (login = conditions.delete(:login))
      where(conditions.to_h).where(['lower(username) = :value OR lower(email) = :value',
                                    { value: login.downcase }]).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'tom.connolly@comcast.net' OR lower(email) = 'tom.connolly@comcast.net') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]