app/models/user.rb

  def maybe_add_stripe_id
    return if stripe_id.present?
---
SELECT  "users".* FROM "users" WHERE (lower(full_name) = 'thomas connolly' OR lower(email) = 'thomas connolly') ORDER BY "users"."id" ASC LIMIT $1