app/jobs/process_events_job.rb

  def perform(event_id)
    event = WebhookEvent.find(event_id)
    if event.pending? || event.failed?
      event.update(state: :processing)
      begin
          Events::StripeHandler.process(event)
      end
        event.update(state: :processed)
    end
      rescue StandardError => e
        event.update(state: :failed, processing_errors: e)
---
SELECT "webhook_events".* FROM "webhook_events" WHERE "webhook_events"."id" = $1 LIMIT $2  [["id", 490], ["LIMIT", 1]]
UPDATE "webhook_events" SET "state" = $1, "updated_at" = $2 WHERE "webhook_events"."id" = $3  [["state", 1], ["updated_at", "2022-10-08 19:27:19.391012"], ["id", 490]]
UPDATE "webhook_events" SET "state" = $1, "updated_at" = $2 WHERE "webhook_events"."id" = $3  [["state", 2], ["updated_at", "2022-10-08 19:27:19.396178"], ["id", 490]]
UPDATE "webhook_events" SET "state" = $1, "processing_errors" = $2, "updated_at" = $3 WHERE "webhook_events"."id" = $4