app/views/members/index.html.erb

<% @members.each do |m| %>
<p><strong><%= m.first_name %>&nbsp;<%= m.last_name %>&nbsp;<%= m.email %> &nbsp;<%#= m.membership_id %> &nbsp;<%= m.anniversary %> &nbsp; <%#= link_to 'Edit', edit_member_path(member) %> <small>
---
SELECT "members".* FROM "members" ORDER BY "members"."last_name" ASC